scripts/exp2/redis-sls-400-08.txt
====== PING_INLINE ======
  100000 requests completed in 2.75 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 0.3 milliseconds
0.01% <= 0.4 milliseconds
0.13% <= 0.5 milliseconds
4.97% <= 0.6 milliseconds
41.69% <= 0.7 milliseconds
86.13% <= 0.8 milliseconds
98.01% <= 0.9 milliseconds
99.19% <= 1.0 milliseconds
99.30% <= 1.1 milliseconds
99.33% <= 1.2 milliseconds
99.35% <= 1.3 milliseconds
99.38% <= 1.4 milliseconds
99.41% <= 1.5 milliseconds
99.43% <= 1.6 milliseconds
99.46% <= 1.7 milliseconds
99.49% <= 1.8 milliseconds
99.52% <= 1.9 milliseconds
99.54% <= 2.0 milliseconds
99.57% <= 2.1 milliseconds
99.57% <= 2 milliseconds
99.65% <= 3 milliseconds
99.67% <= 4 milliseconds
99.70% <= 12 milliseconds
99.77% <= 13 milliseconds
99.80% <= 16 milliseconds
99.82% <= 17 milliseconds
99.85% <= 18 milliseconds
99.90% <= 19 milliseconds
99.90% <= 21 milliseconds
99.91% <= 22 milliseconds
100.00% <= 23 milliseconds
36403.35 requests per second

====== PING_BULK ======
  100000 requests completed in 2.71 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.10% <= 1 milliseconds
99.44% <= 2 milliseconds
99.63% <= 3 milliseconds
99.71% <= 4 milliseconds
99.75% <= 11 milliseconds
99.84% <= 12 milliseconds
99.94% <= 13 milliseconds
99.95% <= 15 milliseconds
99.95% <= 16 milliseconds
100.00% <= 16 milliseconds
36845.98 requests per second

====== SET ======
  100000 requests completed in 2.72 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.16% <= 1 milliseconds
99.52% <= 2 milliseconds
99.65% <= 3 milliseconds
99.67% <= 4 milliseconds
99.70% <= 5 milliseconds
99.76% <= 6 milliseconds
99.80% <= 11 milliseconds
99.82% <= 12 milliseconds
99.89% <= 13 milliseconds
99.90% <= 21 milliseconds
99.90% <= 22 milliseconds
100.00% <= 22 milliseconds
36737.70 requests per second

====== GET ======
  100000 requests completed in 2.78 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.96% <= 1 milliseconds
99.53% <= 2 milliseconds
99.65% <= 3 milliseconds
99.67% <= 4 milliseconds
99.70% <= 5 milliseconds
99.70% <= 11 milliseconds
99.73% <= 12 milliseconds
99.75% <= 21 milliseconds
99.89% <= 22 milliseconds
100.00% <= 22 milliseconds
35997.12 requests per second

====== INCR ======
  100000 requests completed in 2.71 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.18% <= 1 milliseconds
99.55% <= 2 milliseconds
99.75% <= 9 milliseconds
99.80% <= 10 milliseconds
99.80% <= 11 milliseconds
99.84% <= 12 milliseconds
99.85% <= 14 milliseconds
99.90% <= 15 milliseconds
99.93% <= 16 milliseconds
99.95% <= 22 milliseconds
99.98% <= 23 milliseconds
100.00% <= 23 milliseconds
36913.99 requests per second

====== LPUSH ======
  100000 requests completed in 2.76 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.80% <= 1 milliseconds
99.38% <= 2 milliseconds
99.58% <= 3 milliseconds
99.66% <= 4 milliseconds
99.70% <= 5 milliseconds
99.70% <= 12 milliseconds
99.78% <= 13 milliseconds
99.80% <= 15 milliseconds
99.82% <= 16 milliseconds
99.85% <= 21 milliseconds
99.94% <= 22 milliseconds
100.00% <= 22 milliseconds
36179.45 requests per second

====== RPUSH ======
  100000 requests completed in 2.75 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.99% <= 1 milliseconds
99.42% <= 2 milliseconds
99.65% <= 3 milliseconds
99.66% <= 4 milliseconds
99.70% <= 5 milliseconds
99.72% <= 6 milliseconds
99.75% <= 11 milliseconds
99.79% <= 12 milliseconds
99.80% <= 21 milliseconds
99.85% <= 22 milliseconds
99.99% <= 23 milliseconds
100.00% <= 23 milliseconds
36390.10 requests per second

====== LPOP ======
  100000 requests completed in 2.89 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

96.41% <= 1 milliseconds
99.23% <= 2 milliseconds
99.54% <= 3 milliseconds
99.70% <= 4 milliseconds
99.74% <= 5 milliseconds
99.75% <= 6 milliseconds
99.75% <= 7 milliseconds
99.78% <= 8 milliseconds
99.80% <= 11 milliseconds
99.84% <= 12 milliseconds
99.85% <= 17 milliseconds
99.89% <= 18 milliseconds
99.90% <= 21 milliseconds
99.96% <= 22 milliseconds
100.00% <= 22 milliseconds
34578.15 requests per second

====== RPOP ======
  100000 requests completed in 2.78 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.64% <= 1 milliseconds
99.22% <= 2 milliseconds
99.54% <= 3 milliseconds
99.63% <= 4 milliseconds
99.64% <= 5 milliseconds
99.65% <= 6 milliseconds
99.70% <= 7 milliseconds
99.74% <= 8 milliseconds
99.75% <= 11 milliseconds
99.76% <= 12 milliseconds
99.80% <= 14 milliseconds
99.81% <= 15 milliseconds
99.85% <= 18 milliseconds
99.90% <= 19 milliseconds
99.90% <= 21 milliseconds
99.91% <= 22 milliseconds
100.00% <= 23 milliseconds
100.00% <= 23 milliseconds
36036.04 requests per second

====== SADD ======
  100000 requests completed in 2.82 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.29% <= 1 milliseconds
99.38% <= 2 milliseconds
99.59% <= 3 milliseconds
99.61% <= 4 milliseconds
99.65% <= 5 milliseconds
99.65% <= 6 milliseconds
99.68% <= 7 milliseconds
99.70% <= 11 milliseconds
99.72% <= 12 milliseconds
99.75% <= 13 milliseconds
99.82% <= 14 milliseconds
99.85% <= 19 milliseconds
99.90% <= 21 milliseconds
99.93% <= 22 milliseconds
100.00% <= 22 milliseconds
35448.42 requests per second

====== HSET ======
  100000 requests completed in 2.72 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.97% <= 1 milliseconds
99.48% <= 2 milliseconds
99.74% <= 3 milliseconds
99.81% <= 4 milliseconds
99.83% <= 5 milliseconds
99.87% <= 6 milliseconds
99.90% <= 21 milliseconds
99.98% <= 22 milliseconds
100.00% <= 22 milliseconds
36818.85 requests per second

====== SPOP ======
  100000 requests completed in 2.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.14% <= 1 milliseconds
99.50% <= 2 milliseconds
99.70% <= 3 milliseconds
99.73% <= 4 milliseconds
99.75% <= 5 milliseconds
99.76% <= 6 milliseconds
99.80% <= 11 milliseconds
99.93% <= 12 milliseconds
100.00% <= 12 milliseconds
37037.04 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 2.73 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.80% <= 1 milliseconds
99.28% <= 2 milliseconds
99.64% <= 3 milliseconds
99.68% <= 4 milliseconds
99.70% <= 5 milliseconds
99.71% <= 6 milliseconds
99.75% <= 7 milliseconds
99.79% <= 8 milliseconds
99.80% <= 11 milliseconds
99.86% <= 12 milliseconds
99.90% <= 21 milliseconds
99.93% <= 22 milliseconds
100.00% <= 23 milliseconds
100.00% <= 23 milliseconds
36616.62 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 3.33 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

94.11% <= 1 milliseconds
99.19% <= 2 milliseconds
99.60% <= 3 milliseconds
99.65% <= 4 milliseconds
99.69% <= 5 milliseconds
99.70% <= 8 milliseconds
99.74% <= 9 milliseconds
99.82% <= 10 milliseconds
99.85% <= 11 milliseconds
99.86% <= 12 milliseconds
99.90% <= 13 milliseconds
99.90% <= 14 milliseconds
99.92% <= 15 milliseconds
99.97% <= 16 milliseconds
100.00% <= 16 milliseconds
30021.01 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.57 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
98.30% <= 2 milliseconds
98.75% <= 3 milliseconds
99.07% <= 4 milliseconds
99.23% <= 5 milliseconds
99.28% <= 6 milliseconds
99.32% <= 7 milliseconds
99.35% <= 8 milliseconds
99.38% <= 9 milliseconds
99.41% <= 10 milliseconds
99.48% <= 11 milliseconds
99.59% <= 12 milliseconds
99.69% <= 13 milliseconds
99.78% <= 14 milliseconds
99.83% <= 15 milliseconds
99.85% <= 16 milliseconds
99.88% <= 17 milliseconds
99.92% <= 18 milliseconds
99.95% <= 19 milliseconds
99.95% <= 21 milliseconds
99.96% <= 22 milliseconds
99.98% <= 23 milliseconds
100.00% <= 24 milliseconds
100.00% <= 24 milliseconds
17959.77 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 7.03 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
98.31% <= 2 milliseconds
99.22% <= 3 milliseconds
99.38% <= 4 milliseconds
99.52% <= 5 milliseconds
99.57% <= 6 milliseconds
99.60% <= 7 milliseconds
99.62% <= 8 milliseconds
99.65% <= 9 milliseconds
99.69% <= 10 milliseconds
99.75% <= 11 milliseconds
99.83% <= 12 milliseconds
99.90% <= 13 milliseconds
99.96% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 15 milliseconds
14230.82 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 7.94 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
56.44% <= 2 milliseconds
99.84% <= 3 milliseconds
99.91% <= 4 milliseconds
99.93% <= 5 milliseconds
99.96% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 8 milliseconds
12597.63 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.76 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.84% <= 1 milliseconds
100.00% <= 1 milliseconds
36271.31 requests per second